reservoirFoam/darcyOnePhase/tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    openWall
    {
        type            wall;
        nFaces          1;
        startFace       49;
    }
    endWall
    {
        type            wall;
        nFaces          1;
        startFace       50;
    }
    fixedWalls
    {
        type            wall;
        nFaces          100;
        startFace       51;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       151;
    }
)

// ************************************************************************* //
